released/M480BSP_I2C_LSM6DSL/SampleCode/Template/I2C_LSM6DSL.h

/* Define to prevent recursive inclusion -------------------------------------*/
/* Includes ------------------------------------------------------------------*/
#ifndef __I2C_LSM6DSL_H
#define __I2C_LSM6DSL_H

#ifdef __cplusplus
extern "C" {
#endif

#include "NuMicro.h"
#include <stdio.h>
#include <math.h>

#include "i2c_master.h"

//Add to calculate angle
#include "kalman_filter.h"


#define ENABLE_AVERAGE_FILTER
#define ENABLE_KALMAN_FILTER

#define BIT(x) 												( 1<<(x) )

#define LSM6DSL_ADDRESS                     				(0xD6)

#define ACC_ADDRESS                     					(LSM6DSL_ADDRESS)
#define GYRO_ADDRESS                    					(LSM6DSL_ADDRESS)
#define LSM6DSL_I2C_SPEED      								(100000)

#define I2C_SENSOR_PORT  									(MASTER_I2C)

typedef enum
{
	LSM6DSL_OK = 0,
	LSM6DSL_FAIL
}LSM6DSL_Status_TypDef;


/** @addtogroup BSP
 * @{
 */

/** @addtogroup LSM6DSL
 * @{
 */

/** @defgroup LSM6DSL_Exported_Constants
 * @{
 */


/******************************************************************************/
/*********** START ACCELEROMETER AND GYROSCOPE REGISTER MAPPING  **************/
/******************************************************************************/


/***************************************** COMMON REGISTERS ********************************************/

/**
  * @brief FIFO control register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] FUNC_CFG_EN: Enable access to the embedded functions configuration registers (1) from address 02h to 32h. Default value: 0.
  * [6:0] This bit must be set to ??for the correct operation of the device
  * \endcode
*/
#define  LSM6DSL_XG_FUNC_CFG_ACCESS                                      0x01

/**
  * @brief FIFO control register
  * \code
  * Read/write
  * Default value: 0x00
  * [7:0] TPH_[7:0]: Sensor SyncronizationTime Frame with the step of 500ms and full range of 5s. Default: 0000 0000
  * \endcode
*/
#define  LSM6DSL_XG_SENSOR_SYNC_TIME_FRAME                           0x04

/**
  * @brief FIFO control register
  * \code
  * Read/write
  * Default value: 0x00
  * [7:2] This bit must be set to ??for the correct operation of the device
  * [1] HP_RST: Gyro digital HP filter reset. Default: 0
  * [1] SENSOR_SYNC_ENHP_RST: Enable sensor synchronization feature. Default 0
  * \endcode
*/
#define  LSM6DSL_XG_SENSOR_SYNC_ENABLE                             0x05


/**
  * @brief FIFO control register
  * \code
  * Read/write
  * Default value: 0x00
  * [7:0] FTH_7-0 FIFO threshold level setting - watermark flag is toggled when the number of bytes written to FIFO is greater or equal to threshold level.
  * \endcode
*/
#define LSM6DSL_XG_FIFO_CTRL1                               0x06

/**
  * @brief FIFO control register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] TIMER_PEDO_FIFO_EN: Enable Pedometer step counter and time stamp as 4th sensor FIFO data. Default: 0 disabled
  * [6] TIMER_PEDO_FIFO_DRDY : Pedometer FIFO write mode. Default: 0 disabled
  * [5:4] This bit must be set to ??for the correct operation of the device
  * [3:0] FTH_[11:8] FIFO threshold level setting(1). Default value: 0000
  * \endcode
*/
#define LSM6DSL_XG_FIFO_CTRL2                               0x07

/**
  * @brief FIFO control register
  * \code
  * Read/write
  * Default value: 0x00
  * [7:6] This bit must be set to ??for the correct operation of the device
  * [5:3] DEC_FIFO_GYRO[2:0]: Gyro FIFO decimation setting. Default value: 000
  * [2:0] DEC_FIFO_XL[2:0]: XL FIFO decimation setting. Default value: 000
  * \endcode
*/
#define LSM6DSL_XG_FIFO_CTRL3                               0x08

/**
  * @brief FIFO control register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] This bit must be set to ??for the correct operation of the device
  * [6] ONLY_HIGH_DATA :8 bit data storing in FIFO. Default: 0
  * [5:3] DEC_SLV1_FIFO[2:0] Second external sensor FIFO decimation setting. Default: 000
  * [2:0] DEC_SLV1_FIFO[2:0] First external sensor FIFO decimation setting. Default: 000
  * \endcode
*/
#define LSM6DSL_XG_FIFO_CTRL4                               0x09


/**
  * @brief FIFO control register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] This bit must be set to ??for the correct operation of the device
  * [6:3] ODR_FIFO_[3:0]: FIFO ODR selection. Default: 0000
  * [2:0] FIFO_MODE_[2:0] : FIFO mode selection bits. Default value: 000
  * \endcode
*/
#define LSM6DSL_XG_FIFO_CTRL5                               0x0A


/**
  * @brief Angular rate sensor sign and orientation register
  * \code
  * Read/write
  * Default value: 0x00
  * [7:6] This bit must be set to ??for the correct operation of the device
  * [5] SignX_G:  Pitch axis (X) Angular rate sign. Default value: 0
  * [5] SignY_G:  Roll axis (Y) Angular rate sign. Default value: 0
  * [5] SignZ_G:  Pitch axis (Z) Angular rate sign. Default value: 0
  * [2:0] Orient[2:0] : Directional user orientation selection. Default Value: 000
  * \endcode
*/
#define LSM6DSL_XG_ORIENT_CFG_G                               0x0B

/**
  * @brief INT1 pad control registrer
  * \code
  * Read/write
  * Default value: 0x00
  * [7] INT1_PEDO: Pedometer step recognition interrupt enable on INT1 pad. Default value: 0
  * [6] INT1_SIGN_MOT: Significant motion interrupt enable on INT1 pad. Default value: 0
  * [5] INT1_FULL_FLAG: Full flag Interrupt Enable on INT1 pad. Default value: 0
  * [4] INT1_OVR: Overrun Interrupt on INT1 pad. Default value: 0
  * [3] INT1_FTH: FIFO threshold interrupt on INT1 pad. Default value: 0
  * [2] INT1_BOOT: Overrun Interrupt on INT1 pad. Default value: 0
  * [1] INT1_DRDY_G: Gyroscope Data Ready on INT1 pad. Default value: 0.
  * [0] INT1_DRDY_XL: Accelerometer Data Ready on INT1 pad. Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_INT1_CTRL                                 0x0D


 //new, done
/**
  * @brief INT2 pad control registrer
  * \code
  * Read/write
  * Default value: 0x00
  * [7] INT2_PEDO: Pedometer step recognition interrupt enable on INT1 pad. Default value: 0
  * [6] INT2_SIGN_MOT: Significant motion interrupt enable on INT1 pad. Default value: 0
  * [5] INT2_FULL_FLAG: Full flag Interrupt Enable on INT1 pad. Default value: 0
  * [4] INT2_OVR: Overrun Interrupt on INT1 pad. Default value: 0
  * [3] INT2_FTH: FIFO threshold interrupt on INT1 pad. Default value: 0
  * [2] INT2_BOOT: Overrun Interrupt on INT1 pad. Default value: 0
  * [1] INT2_DRDY_G: Gyroscope Data Ready on INT1 pad. Default value: 0.
  * [0] INT2_DRDY_XL: Accelerometer Data Ready on INT1 pad. Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_INT2_CTRL                                 0x0E


/**
  * @brief Device identifier register.
  * \code
  * Read
  * Default value:69
  * [7:0] This read-only register contains the device identifier
  * \endcode
*/
#define LSM6DSL_XG_WHO_AM_I_ADDR                            0x0F


/**
  * @brief Control Register 3
  * \code
  * Read/write
  * Default value: 0x00
  * [7] BOOT: Reboot memory content. Default value: 0
  * [6] BDU: Block Data Update. Default value: 0
  * [5] H_LACTIVE: Interrupt activation level. Default value: 0
  * [4] PP_OD: Push-pull/Open Drain selection on INT pad. Default value: 0
  * [3] SIM: SPI Serial Interface Mode selection. Default value: 0
  * [2] IF_INC: Register address automatically incremented during a multiple byte access with a serial interface (I2C or SPI). Default value: 0
  * [1] BLE: Big/Little Endian Data Selection. Default value: 0
  * [0] SW_RESET: Software Reset. Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_CTRL3_C                                  0x12
//new
/**
  * @brief Control Register 4
  * \code
  * Read/write
  * Default value: 0x00
  * [7] BW_SCAL_ODR: Accelerometer bandwidth selection. Default value: 0
  * [6] SLEEP_G: Gyroscope sleep mode enable. Default value: 0
  * [5] INT2_on_INT1: All interrupt signals available on INT1 pad enable. Default value: 0
  * [4] This bit must be set to ??for the correct operation of the device
  * [3] DRDY_MASK: Configuration 1(3) Data Available Enable bit. Default Value: 0
  * [2] I2C_disable Disable I2C interface. Default value: 0
  * [1] MODE3_EN Enable auxiliary SPI interface (Mode3, refer to Table 1.). Default value: 0
  * [0] STOP_ON_FTH Enable FIFO threshold level use. Default value: 0.

