released/M480BSP_I2C_LSM6DSL/SampleCode/Template/I2C_LSM6DSL.h
  * \endcode
*/
#define LSM6DSL_XG_CTRL4_C                                  0x13

//new tbd
/**
  * @brief Control Register 4
  * \code
  * Read/write
  * Default value: 0x00
  * [7:4] This bit must be set to ??for the correct operation of the device
  * [3:2] ST_G[1:0]: Angular rate sensor Self Test Enable. Default value: 00
  * [1:0] ST_XL[1:0]: Linear acceleration sensor Self Test Enable. Default value: 00
  * \endcode
*/
#define LSM6DSL_XG_CTRL5_C                                  0x14


/**
  * @brief Control Register 10
  * \code
  * Read/write
  * Default value: 0x38
  * [7:6] These bits must be set to ??for the correct operation of the device
  * [5] Zen_G: Gyroscope’s Z-axis output enable. Default value: 1
  * [4] Yen_G: Gyroscope’s Y-axis output enable. Default value: 1
  * [3] Xen_G: Gyroscope’s X-axis output enable. Default value: 1
  * [2] FUNC_EN: Enable embedded functionalities (pedometer, tilt and significant motion) .  Default value: 0
  * [1] PEDO_RST_STEP: Reset pedometer step counter .  Default value: 0
  * [0] SIGN_MOTION_EN: Enable significant motion function. For a correct functionality of significant motion function, TILT_EN bit in FUNC_SRC (53h) register must be set to 1 .  Default value: 1
  * \endcode
*/
#define LSM6DSL_XG_CTRL10_C                                 0x19


/**
  * @brief Sensor hub Master config Register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] DRDY_ON_INT1:Manage the DRDY signal on INT1 pad. Default: 0
  * [6] DATA_VALID_SEL_FIFO: Selection of FIFO data-valid signal. Default value: 0
  * [5] This bit must be set to ??for the correct operation of the device
  * [4] START_CONFIG: Sensor Hub trigger signal selection. Default value: 0
  * [3] PULL_UP_EN: Auxiliary I2C pull-up. Default value: 0
  * [2] PASS_THROUGH_MODE: I2C interface pass-through. Default value: 0
  * [1] IRON_EN:Enable soft iron correction algorithm for magnetometer. Default value: 0.
  * [0] MASTER_ON: Sensor Hub I2C master enable. Default: 0
  * \endcode
*/
#define LSM6DSL_XG_MASTER_CONFIG                                 0x1A


/**
  * @brief Wake up interrupt source register
  * \code
  * Read
  * Default value: output
  * [7:6] This bit must be set to ??for the correct operation of the device
  * [5] FF_IA: Free fall event detection status. Default: 0
  * [4] SLEEP_STATE_IA: Sleep event status. Default value: 0
  * [3] WU_IA: Wake up event detection status. Default
  * [2] X_WU: detection status on X axis. Default value: 0
  * [1] X_WU: detection status on Y axis. Default value: 0
  * [0] X_WU: detection status on Z axis. Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_WAKE_UP_SRC                                 0x1B

/**
  * @brief Tap source register
  * \code
  * Read
  * Default value: output
  * [7] This bit must be set to ??for the correct operation of the device
  * [6] TAP_IA: Tap event detection status. Default: 0
  * [5] SINGLE_TAP: Single tap event status. Default value: 0
  * [4] DOUBLE_TAP: Double tap event detection status. Default value: 0
  * [3] TAP_SIGN: Sign of acceleration detected by tap event. Default: 0
  * [2] X_TAP: Tap event detection status on X axis. Default value: 0
  * [1] Y_TAP: Tap event detection status on Y axis. Default value: 0
  * [0] Z_TAP: Tap event detection status on Z axis. Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_TAP_SRC                                    0x1C

/**
  * @brief Portrait, landscape face-up and face-down source register
  * \code
  * Read
  * Default value: output
  * [7] This bit must be set to ??for the correct operation of the device
  * [6] D6D_IA: Interrupt active for change position portrait, landscape, face-up, face-down. Default value: 0
  * [5] ZH: Z-axis high event (over-threshold). Default value: 0
  * [4] ZL: Z-axis low event (under-threshold). Default value: 0
  * [5] YH: Y-axis high event (over-threshold). Default value: 0
  * [4] YL: Y-axis low event (under-threshold). Default value: 0
  * [5] X_H: X-axis high event (over-threshold). Default value: 0
  * [4] X_L: X-axis low event (under-threshold). Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_D6D_SRC                                   0x1D

/**
  * @brief Status register
  * \code
  * Read
  * Default value: output
  * [7:4] No meaning set
  * [3] EV_BOOT: Boot running flag signal. Default value: 0
  * [2] No meaning set
  * [1] GDA: Gyroscope new data avaialble. Default value: 0
  * [0] XLDA: Accelerometer new data avaialble. Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_STATUS_REG                                  0x1E

/**
  * @brief FIFO status control register
  * \code
  * Read
  * Default value: 0x00
  * [7:0] DIFF_FIFO_[7:0]: Number of unread words (16 bit axes) stored in FIFO . For a complete number of unread samples, consider DIFF_FIFO [11:8] in FIFO_STATUS2 (3Bh)
  * \endcode
*/
#define LSM6DSL_XG_FIFO_STATUS1                                   0x3A

/**
  * @brief FIFO status control register (r). For a proper reading of the register it is suggested to set BDU bit in CTRL3_C (12h) to 0.
  * \code
  * Read
  * Default value: 0x00
  * [7] FTH FIFO watermark status. Deafult value: 0
  * [6] OVER_RUN: FIFO overrun status. Default value: 0
  * [5] FIFO_FULL: FIFO full status. Default value: 0
  * [5] FIFO_EMPTY: FIFO empty bit. Default value: 0; 0: FIFO contains data; 1: FIFO is empty
  * [3:0] DIFF_FIFO_[11:8] Number of unread words (16 bit axes) stored in FIFO : For a complete number of unread samples, consider DIFF_FIFO [11:8] in FIFO_STATUS1 (3Ah)
  * \endcode
*/
#define LSM6DSL_XG_FIFO_STATUS2                                  0x3B

/**
  * @brief FIFO status control register (r). For a proper reading of the register it is suggested to set BDU bit in CTRL3_C (12h) to 0
  * \code
  * Read
  * Default value: 0x00
  * [7:0] FIFO_PATTERN_[7:0] : Word of recursive pattern read at the next reading
  * \endcode
*/
#define LSM6DSL_XG_FIFO_STATUS3                                  0x3C

/**
  * @brief FIFO status control register (r). For a proper reading of the register it is suggested to set BDU bit in CTRL3_C (12h) to 0
  * \code
  * Read
  * Default value: 0x00
  * [1:0] FIFO_PATTERN_[9:8] : Word of recursive pattern read at the next reading
  * \endcode
*/
#define LSM6DSL_XG_FIFO_STATUS4                                  0x3D

/**
  * @brief FIFO status control register (r). For a proper reading of the register it is suggested to set BDU bit in CTRL3_C (12h) to 0.
  * \code
  * Read
  * Default value: 0x00
  * [4:0] FIFO_PATTERN_[9:8] : Word of recursive pattern read at the next reading
  * \endcode
*/
#define LSM6DSL_XG_FIFO_STATUS4                                  0x3D

/**
  * @brief FIFO data output register (r). For a proper reading of the register it is suggested to set BDU bit in CTRL3_C (12h) to 0.
  * \code
  * Read
  * Default value: 0x00
  * [7:0] DATA_OUT_FIFO_L_[7:0]: FIFO data output (First byte)
  * \endcode
*/
#define LSM6DSL_XG_FIFO_DATA_OUT_L                                  0x3E

/**
  * @brief FIFO data output register (r). For a proper reading of the register it is suggested to set BDU bit in CTRL3_C (12h) to 0.
  * \code
  * Read
  * Default value: 0x00
  * [7:0] DATA_OUT_FIFO_H_[7:0]: FIFO data output (second byte)
  * \endcode
*/
#define LSM6DSL_XG_FIFO_DATA_OUT_H                                  0x3F

/**
  * @brief Time stamp first byte data output register (r). The value is expressed as 24 bit and the bit resolution is defined by setting value in WAKE_UP_DUR (5Ch).
  * \code
  * Read
  * Default value: output
  * [7:0] TIMESTAMP0_[7:0]: FIFO first byte data output
  * \endcode
*/
#define LSM6DSL_XG_TIMESTAMP0_REG                                  0x40

/**
  * @brief Time stamp second byte data output register (r). The value is expressed as 24 bit and the bit resolution is defined by setting value in WAKE_UP_DUR (5Ch).
  * \code
  * Read
  * Default value: output
  * [7:0] TIMESTAMP1_[7:0]: FIFO second byte data output
  * \endcode
*/
#define LSM6DSL_XG_TIMESTAMP1_REG                                  0x41

/**
  * @brief Time stamp third byte data output register (r). The value is expressed as 24 bit and the bit resolution is defined by setting value in WAKE_UP_DUR (5Ch).
  * \code
  * Read
  * Default value: output
  * [7:0] TIMESTAMP2_[7:0]: FIFO third byte data output
  * \endcode
*/
#define LSM6DSL_XG_TIMESTAMP2_REG                                  0x42

/**
  * @brief Step counter output register (r).
  * \code
  * Read
  * Default value: output
  * [7:0] STEP_COUNTER_L_[7:0]: Step counter output (LSbyte)
  * \endcode
*/
#define LSM6DSL_XG_STEP_COUNTER_L                                  0x4B

/**
  * @brief Step counter output register (r).
  * \code
  * Read
  * Default value: output
  * [7:0] STEP_COUNTER_H_[7:0]: Step counter output (MSbyte)
  * \endcode
*/
#define LSM6DSL_XG_STEP_COUNTER_H                                  0x4C

/**
  * @brief Significant motion, tilt, step detector, soft iron and sensor hub interrupt source register
  * \code
  * Read
  * Default value: output
  * [7] This bit must be set to ??for the correct operation of the device
  * [6] SIGN_MOTION_IA: Significant motion event detection status. Default value: 0
  * [5] TILT_IA: Tilt event detection status. Default value: 0
  * [5] STEP_DETECTED: Step detector event detection status. Default value: 0
  * [3:2]  This bit must be set to ??for the correct operation of the device
  * [1] SI_END_OP:Soft iron calculation status. Default value: 0
  * [0] SENSORHUB_END_OP:Senso hub communication status.  Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_FUNC_SRC                                             0x53

/**
  * @brief Time stamp, pedometer, tilt, filtering, and tap recognition functions configuration register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] TIMER_EN: Time stamp count enable, output data are collected in TIMESTAMP0_REG (40h), TIMESTAMP1_REG (41h), TIMESTAMP2_REG (42h) register. Default: 0
  * [6] PEDO_EN: Pedometer algorithm enable(1). Default value: 0
  * [5] TILT_EN: Tilt calculation enable.(2) Default value: 0
  * [4] This bit must be set to ??for the correct operation of the device
  * [3] TAP_X_EN: Enable X direction in tap recognition. Default value: 0
  * [2] TAP_Y_EN: Enable Z direction in tap recognition. Default value: 0
  * [1] TAP_Z_EN: Enable Z direction in tap recognition. Default value: 0
  * [0] LIR: Relatch of the time stamp, pedometer, tilt, filtering, and tap recognition functions routed to PINs.
  * \endcode
*/
#define LSM6DSL_XG_TAP_CFG                                             0x58

/**
  * @brief Portrait/landscape position and tap function threshold register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] This bit must be set to ??for the correct operation of the device
  * [6:5] SIXD_THS[1:0]: Threshold for D6D function. Default value: 00
  * [4:0] TAP_THS[4:0]: Threshold for tap recognition. Default value: 0000
  * \endcode
*/
#define LSM6DSL_XG_TAP_THS_6D                                             0x59

/**
  * @brief Tap recognition function setting register (r/w)
  * \code
  * Read/write
  * Default value: 0x00
  * [7:4] DUR[3:0]: Duration of maximum time gap for double tap recognition. Default: 0000
  * [3:2] QUIET[1:0]: Expected quiet time after a tap detection. Default value: 00
  * [1:0] SHOCK[1:0]: Maximum duration of over-threshold event. Default value: 00
  * \endcode
*/
#define LSM6DSL_XG_INT_DUR2                                             0x5A

/**
  * @brief Tap recognition function setting register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] SINGLE_DOUBLE_TAP: Single/double tap event detection. Default: 0
  * [6] INACTIVITY: Inactivity event enable. Default value: 0
  * [5:0] WK_THS[5:0]:Threshold for wake-up. Default value: 0000
  * \endcode
*/
#define LSM6DSL_XG_WAKE_UP_THS                                                   0x5B

/**
  * @brief Free-fall, wake-up, time stamp and sleep mode functions duration setting register (r/w).
  * \code
  * Read/write
  * Default value: 0x00
  * [7] FF_DUR5:Free fall duration event. Default: 0
  * [6:5] WAKE_DUR[1:0]: Wake up duration event. Default: 00
  * [4] TIMER_HR: Time stamp register resolution setting(1). Default value: 0
  * [3:0] SLEEP_DUR[3:0] : Duration to go in sleep mode. Default value: 0000
  * \endcode
*/
#define LSM6DSL_XG_WAKE_UP_DUR                                                   0x5C

/**
  * @brief Free-fall function duration setting register
  * \code
  * Read/write
  * Default value: 0x00
  * [7:3] FF_DUR[4:0]: Free fall duration event. Default: 0. For the complete configuration of the free fall duration, refer to FF_DUR5 in WAKE_UP_DUR (5Ch) configuration
  * [2:0] FF_THS[2:0]: Free fall threshold setting. Default: 000.
  * \endcode
*/
#define LSM6DSL_XG_WAKE_FREE_FALL                                                   0x5D

/**
  * @brief Functions routing on INT1 register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] INT1_INACT_STATE: Routing on INT1 of inactivity mode. Default: 0
  * [6] INT1_SINGLE_TAP: Single tap recognition routing on INT1. Default: 0
  * [5] INT1_WU: Routing of wake-up event on INT1. Default value: 0
  * [4] INT1_FF: Routing of free-fall event on INT1. Default value: 0
  * [3] INT1_TAP: Routing of tap event on INT1. Default value: 0
  * [2] INT1_6D: Routing of 6D event on INT1. Default value: 0
  * [1] INT1_TILT: Routing of tilt event on INT1. Default value: 0
  * [0] INT1_TIMER: Routing of end counter event of timer on INT1. Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_MD1_CFG                                                   0x5E

/**
  * @brief Functions routing on INT2 register
  * \code
  * Read/write
  * Default value: 0x00
  * [7] INT2_INACT_STATE: Routing on INT1 of inactivity mode. Default: 0
  * [6] INT2_SINGLE_TAP: Single tap recognition routing on INT1. Default: 0
  * [5] INT2_WU: Routing of wake-up event on INT1. Default value: 0
  * [4] INT2_FF: Routing of free-fall event on INT1. Default value: 0
  * [3] INT2_TAP: Routing of tap event on INT1. Default value: 0
  * [2] INT2_6D: Routing of 6D event on INT1. Default value: 0
  * [1] INT2_TILT: Routing of tilt event on INT1. Default value: 0
  * [0] INT2_TIMER: Routing of end counter event of timer on INT1. Default value: 0
  * \endcode
*/
#define LSM6DSL_XG_MD2_CFG                                                   0x5F

/***************************************** SENSORHUB REGISTERS ********************************************/

/**
  * @brief SENSORHUB REGISTER 1 : SLV0 first external sensor, first axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB1[7:0]: SLV0 first external sensor, first byte of the first axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB1_REG                       0x2E

/**
  * @brief SENSORHUB REGISTER 2 : SLV0 first external sensor, first axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB2[7:0]: SLV0 first external sensor, second byte of the first axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB2_REG                       0x2F

/**
  * @brief SENSORHUB REGISTER 3 : SLV0 first external sensor, second axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB3[7:0]: SLV0 first external sensor, first byte of the second axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB3_REG                       0x30

/**
  * @brief SENSORHUB REGISTER 4 : SLV0 first external sensor, second axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB4[7:0]: SLV0 first external sensor, second byte of the second axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB4_REG                       0x31

/**
  * @brief SENSORHUB REGISTER 5 : SLV0 first external sensor, third axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB5[7:0]: SLV0 first external sensor, second byte of the second axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB5_REG                       0x32

/**
  * @brief SENSORHUB REGISTER 6 : SLV0 first external sensor, third axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB6[7:0]: SLV0 first external sensor, second byte of the third axis
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB6_REG                       0x33

/**
  * @brief SENSORHUB REGISTER 7 : SLV1 second external sensor, first axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB7[7:0]: SLV1 second external sensor, first byte of the first axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB7_REG                       0x34

/**
  * @brief SENSORHUB REGISTER 8 : SLV1 second external sensor, first axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB8[7:0]: SLV1 second external sensor, second byte of the first axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB8_REG                       0x35

/**
  * @brief SENSORHUB REGISTER 9 : SLV1 second external sensor,, second axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB9[7:0]: SLV1 second external sensor, first byte of the second axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB9_REG                       0x36

/**
  * @brief SLV1 second external sensor, second axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB10[7:0]: SLV1 second external sensor, second byte of the second axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB10_REG                       0x37

/**
  * @brief SLV1 second external sensor, third axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB11[7:0]: SLV1 second external sensor, first byte of the third axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB11_REG                       0x38

/**
  * @brief SLV1 second external sensor, third axis output register (r). The value is expressed as 16bit word in two’s complement
  * \code
  * Read
  * Default value: 0x00
  * [7:0] SHUB12[7:0]: SLV1 second external sensor, second byte of the third axis.
  * \endcode
*/
#define  LSM6DSL_XG_SENSORHUB12_REG                       0x39




/***************************************** GYROSCOPE REGISTERS ********************************************/

/**
  * @brief Angular rate sensor Control Register 2
  * \code
  * Read/write
  * Default value: 0x00
  * [7:4] ODR_G[3:0]: Gyroscope output data rate selection
  * [3:2] FS_G[1-0]: Gyroscope full-scale selection
  * [1] FS_125: Gyroscope full-scale at 125 dps
  * [0] This bit must be set to ??for the correct operation of the device
  * \endcode
 */
#define LSM6DSL_XG_CTRL2_G                                  0x11


/**
  * @brief Angular rate sensor Control Register 6
  * \code
  * Read/write
  * Default value: 0x00
  * [7] TRIG_EN: Data edge sensitive trigger Enable. Default value: 0
  * [6] LVLen: Data level sensitive trigger Enable. Default value: 0
  * [5] LVL2en: Level sensitive latched Enable. Default value: 0
  * [4] XL_H_MODE: High Performance operating mode disable for accelerometer(1). Default value: 0
  * [3:0] This bit must be set to ??for the correct operation of the device
  * \endcode
 */
#define LSM6DSL_XG_CTRL6_G                                  0x15


  /**
  * @brief Angular rate sensor Control Register 7
  * \code
  * Read/write
  * Default value: 0x00
  * [7] G_H_MODE: High Performance operating mode disable for Gyroscope(1) . Default: 0
  * [6] HP_EN: High Pass filter Enable. Default Value: 0
  * [5:4] HPCF_G[1:0]: Gyroscope High Pass filter Cut Off frequency selection. Default value: 00
  * [3:0] This bit must be set to ??for the correct operation of the device
  * \endcode
 */
#define LSM6DSL_XG_CTRL7_G                                  0x16

/**
  * @brief Gyroscope data (LSB)
  * \code
  * Read
  * \endcode
 */
#define LSM6DSL_XG_OUT_X_L_G                                0x22


/**
  * @brief Gyroscope data (MSB)
  * \code
  * Read
  * \endcode
 */
#define LSM6DSL_XG_OUT_X_H_G                                0x23


/**
 * @brief Gyroscope data (LSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_Y_L_G                                0x24


/**
 * @brief Gyroscope data (MSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_Y_H_G                                0x25


/**
 * @brief Gyroscope data (LSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_Z_L_G                                0x26


/**
 * @brief Gyroscope data (MSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_Z_H_G                                0x27



