released/M480BSP_I2C_LSM6DSL/SampleCode/Template/I2C_LSM6DSL.h
/*************************************** ACCELEROMETER REGISTERS *******************************************/

/**
 * @brief Linear acceleration sensor Control Register 1
 * \code
 * Read/write
 * Default value: 0x00
 * [7:4] ODR_XL3-0: Accelerometer Output data rate and power mode selection
 * [3:2] FS_XL1-0: Accelerometer full-scale selection
 * [1:0] BW_XL1-0: Anti-aliasing filter bandwidth selection
 * \endcode
 */
#define LSM6DSL_XG_CTRL1_XL                                 0x10

  /**
  * @brief XL sensor Control Register 8
  * \code
  * Read/write
  * Default value: 0x00
  * [7:3] This bit must be set to ??for the correct operation of the device
  * [2] SLOPE_FDS: Enable HP filter on output registers and FIFO. Default value: 0
  * [1:0] This bit must be set to ??for the correct operation of the device
  * \endcode
 */
#define LSM6DSL_XG_CTRL8_XL                                 0x17

/**
  * @brief Linear acceleration sensor Control Register 9
  * \code
  * Read/write
  * Default value: 0x38
  * [7:6] These bits must be set to ??for the correct operation of the device
  * [5] Zen_XL: Accelerometers’s Z-axis output enable
  * [4] Yen_XL: Accelerometers’s Y-axis output enable
  * [3] Xen_XL: Accelerometers’s X-axis output enable
  * [2:0] These bits must be set to ??for the correct operation of the device
  * \endcode
*/
#define LSM6DSL_XG_CTRL9_XL                                	0x18


/**
 * @brief Accelerometer data (LSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_X_L_XL                        		0x28


/**
 * @brief Accelerometer data (MSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_X_H_XL                  				0x29


/**
 * @brief Accelerometer data (LSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_Y_L_XL                          		0x2A


/**
 * @brief Accelerometer data (MSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_Y_H_XL                          		0x2B


/**
 * @brief Accelerometer data (LSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_Z_L_XL                          		0x2C


/**
 * @brief Accelerometer data (MSB)
 * \code
 * Read
 * \endcode
 */
#define LSM6DSL_XG_OUT_Z_H_XL                       		0x2D

/******************************************************************************/
/************* END ACCELEROMETER AND GYROSCOPE REGISTER MAPPING  **************/
/******************************************************************************/



/************************************** COMMON REGISTERS VALUE *******************************************/

/**
* @brief Device Address
*/
#define LSM6DSL_ADDRESS_LOW                                 	0xD4    // SAD[0] = 0
#define LSM6DSL_ADDRESS_HIGH                                	0xD6    // SAD[0] = 1
#define LSM6DSL_XG_MEMS_ADDRESS                             	LSM6DSL_ADDRESS_LOW    // SAD[0] = 0


/**
 * @brief Device Identifier. Default value of the WHO_AM_I register.
 */
#define I_AM_LSM6DSL_XG                                 ((uint8_t)0x69)


/**
  * @brief  Register address automatically incremented during a multiple byte
  *         access with a serial interface (I2C or SPI). Default value of the
  *         LSM6DSL_XG_CTRL3_C register.
  */
#define LSM6DSL_XG_IF_INC                               ((uint8_t)0x04)

#define LSM6DSL_XG_IF_INC_MASK                          ((uint8_t)0x04)


#define LSM6DSL_ACC_GYRO_BDU_BLOCK_UPDATE      		(0x40)

#define LSM6DSL_ACC_GYRO_BDU_MASK   					(0x40)


#define LSM6DSL_ACC_GYRO_SW_RESET_RESET_DEVICE     	(0x01)

#define LSM6DSL_ACC_GYRO_SW_RESET_MASK    			(0x01)

/**
  * @brief  FIFO ODR selection FIFO_CTRL5
  */
#define LSM6DSL_XG_FIFO_ODR_NA                          ((uint8_t)0x00) /*!< FIFO ODR NA */
#define LSM6DSL_XG_FIFO_ODR_10HZ                        ((uint8_t)0x08) /*!< FIFO ODR 10Hz */
#define LSM6DSL_XG_FIFO_ODR_25HZ                        ((uint8_t)0x10) /*!< FIFO ODR 25Hz */
#define LSM6DSL_XG_FIFO_ODR_50HZ                        ((uint8_t)0x18) /*!< FIFO ODR 50Hz */
#define LSM6DSL_XG_FIFO_ODR_100HZ                       ((uint8_t)0x20) /*!< FIFO ODR 100Hz */
#define LSM6DSL_XG_FIFO_ODR_200HZ                       ((uint8_t)0x28) /*!< FIFO ODR 200Hz */
#define LSM6DSL_XG_FIFO_ODR_400HZ                       ((uint8_t)0x30) /*!< FIFO ODR 400Hz */
#define LSM6DSL_XG_FIFO_ODR_800HZ                       ((uint8_t)0x38) /*!< FIFO ODR 800Hz */
#define LSM6DSL_XG_FIFO_ODR_1600HZ                      ((uint8_t)0x40) /*!< FIFO ODR 1600Hz */
#define LSM6DSL_XG_FIFO_ODR_3300HZ                      ((uint8_t)0x48) /*!< FIFO ODR 3300Hz */
#define LSM6DSL_XG_FIFO_ODR_6600HZ                      ((uint8_t)0x50) /*!< FIFO ODR 6600Hz */

#define LSM6DSL_XG_FIFO_ODR_MASK                        ((uint8_t)0x78)


/**
  * @brief  FIFO mode selection FIFO_CTRL5
  */
#define LSM6DSL_XG_FIFO_MODE_BYPASS                     ((uint8_t)0x00) /*!< BYPASS Mode. FIFO turned off */
#define LSM6DSL_XG_FIFO_MODE_FIFO                       ((uint8_t)0x01) /*!< FIFO Mode. Stop collecting data when FIFO is full */
#define LSM6DSL_XG_FIFO_MODE_CONTINUOUS_THEN_FIFO       ((uint8_t)0x03) /*!< CONTINUOUS mode until trigger is deasserted, then FIFO mode */
#define LSM6DSL_XG_FIFO_MODE_BYPASS_THEN_CONTINUOUS     ((uint8_t)0x04) /*!< BYPASS mode until trigger is deasserted, then CONTINUOUS mode */
#define LSM6DSL_XG_FIFO_MODE_CONTINUOUS_OVERWRITE       ((uint8_t)0x05) /*!< CONTINUOUS mode. If the FIFO is full the new sample overwrite the older one */

#define LSM6DSL_XG_FIFO_MODE_MASK                       ((uint8_t)0x07)



/************************************** GYROSCOPE REGISTERS VALUE *******************************************/


/** @addtogroup LSM6DSL_XG Gyroscope Output Data Rate selection CTRL_REG1_G
 * @{
 */
#define LSM6DSL_G_ODR_PD                                ((uint8_t)0x00) /*!< Output Data Rate: Power-down*/
#define LSM6DSL_G_ODR_13HZ                              ((uint8_t)0x10) /*!< Output Data Rate: 13 Hz*/
#define LSM6DSL_G_ODR_26HZ                              ((uint8_t)0x20) /*!< Output Data Rate: 26 Hz*/
#define LSM6DSL_G_ODR_52HZ                              ((uint8_t)0x30) /*!< Output Data Rate: 52 Hz */
#define LSM6DSL_G_ODR_104HZ                             ((uint8_t)0x40) /*!< Output Data Rate: 104 Hz */
#define LSM6DSL_G_ODR_208HZ                             ((uint8_t)0x50) /*!< Output Data Rate: 208 Hz */
#define LSM6DSL_G_ODR_416HZ                             ((uint8_t)0x60) /*!< Output Data Rate: 416 Hz */
#define LSM6DSL_G_ODR_833HZ                             ((uint8_t)0x70) /*!< Output Data Rate: 833 Hz */
#define LSM6DSL_G_ODR_1K66HZ                            ((uint8_t)0x80) /*!< Output Data Rate: 1.66 kHz */

#define LSM6DSL_G_ODR_MASK                              ((uint8_t)0xF0)

/**
 * @}
 */


/** @addtogroup LSM6DSL_XG Gyroscope Full scale selection CTRL2_G
 * @{
 */
#define LSM6DSL_G_FS_125                               ((uint8_t)0x02) /*!< Full scale: 125 dps*/
#define LSM6DSL_G_FS_245                               ((uint8_t)0x00) /*!< Full scale: 245 dps*/
#define LSM6DSL_G_FS_500                               ((uint8_t)0x04) /*!< Full scale: 500 dps */
#define LSM6DSL_G_FS_1000                              ((uint8_t)0x08) /*!< Full scale: 1000 dps */
#define LSM6DSL_G_FS_2000                              ((uint8_t)0x0C) /*!< Full scale: 2000 dps */

#define LSM6DSL_G_FS_MASK                              ((uint8_t)0x0C)

#define LSM6DSL_G_FS_125_SENSITIVITY                   	((float)4.375)
#define LSM6DSL_G_FS_245_SENSITIVITY                   	((float)8.75)
#define LSM6DSL_G_FS_500_SENSITIVITY                   	((float)17.50)
#define LSM6DSL_G_FS_1000_SENSITIVITY                 	((float)35)
#define LSM6DSL_G_FS_2000_SENSITIVITY                  	((float)70)


/**
 * @}
 */


/** @addtogroup LSM6DSL_XG Gyroscope’s Z-axis output enable selection CTRL10_C
 * @{
 */
#define LSM6DSL_G_ZEN_DISABLE                          ((uint8_t)0x00) /*!< Gyroscope’s Z-axis output enable: disable */
#define LSM6DSL_G_ZEN_ENABLE                           ((uint8_t)0x20) /*!< Gyroscope’s Z-axis output enable: enable */

#define LSM6DSL_G_ZEN_MASK                             ((uint8_t)0x20)

/**
 * @}
 */


/** @addtogroup LSM6DSL_XG Gyroscope’s Y-axis output enable selection CTRL10_C
 * @{
 */
#define LSM6DSL_G_YEN_DISABLE                          ((uint8_t)0x00) /*!< Gyroscope’s Y-axis output enable: disable */
#define LSM6DSL_G_YEN_ENABLE                           ((uint8_t)0x10) /*!< Gyroscope’s Y-axis output enable: enable */

#define LSM6DSL_G_YEN_MASK                             ((uint8_t)0x10)

/**
 * @}
 */


