released/M480BSP_I2C_LSM6DSL/SampleCode/Template/I2C_LSM6DSL.h
/** @addtogroup LSM6DSL_XG Gyroscope’s X-axis output enable selection CTRL10_C
 * @{
 */
#define LSM6DSL_G_XEN_DISABLE                          ((uint8_t)0x00) /*!< Gyroscope’s X-axis output enable: disable */
#define LSM6DSL_G_XEN_ENABLE                           ((uint8_t)0x08) /*!< Gyroscope’s X-axis output enable: enable */

#define LSM6DSL_G_XEN_MASK                             ((uint8_t)0x08)

/**
 * @}
 */


/************************************ ACCELEROMETER REGISTERS VALUE *****************************************/

/** @addtogroup LSM6DSL_XG Accelerometer Output Data Rate selection CTRL1_XL
 * @{
 */
#define LSM6DSL_XL_ODR_PD                               ((uint8_t)0x00) /*!< Output Data Rate: Power-down*/
#define LSM6DSL_XL_ODR_13HZ                             ((uint8_t)0x10) /*!< Output Data Rate: 13 Hz*/
#define LSM6DSL_XL_ODR_26HZ                             ((uint8_t)0x20) /*!< Output Data Rate: 26 Hz*/
#define LSM6DSL_XL_ODR_52HZ                             ((uint8_t)0x30) /*!< Output Data Rate: 52 Hz */
#define LSM6DSL_XL_ODR_104HZ                            ((uint8_t)0x40) /*!< Output Data Rate: 104 Hz */
#define LSM6DSL_XL_ODR_208HZ                            ((uint8_t)0x50) /*!< Output Data Rate: 208 Hz */
#define LSM6DSL_XL_ODR_416HZ                            ((uint8_t)0x60) /*!< Output Data Rate: 416 Hz */
#define LSM6DSL_XL_ODR_833HZ                            ((uint8_t)0x70) /*!< Output Data Rate: 833 Hz */
#define LSM6DSL_XL_ODR_1K66HZ                           ((uint8_t)0x80) /*!< Output Data Rate: 1.66 kHz */
#define LSM6DSL_XL_ODR_3K33HZ                           ((uint8_t)0x90) /*!< Output Data Rate: 3.33 kHz */
#define LSM6DSL_XL_ODR_6K66HZ                           ((uint8_t)0xA0) /*!< Output Data Rate: 6.66 kHz */

#define LSM6DSL_XL_ODR_MASK                             ((uint8_t)0xF0)

/**
 * @}
 */


/** @addtogroup LSM6DSL_XG Accelerometer Full scale selection CTRL1_XL
 * @{
 */
#define LSM6DSL_XL_FS_2G                                ((uint8_t)0x00) /*!< Full scale: +- 2g */
#define LSM6DSL_XL_FS_4G                                ((uint8_t)0x08) /*!< Full scale: +- 4g */
#define LSM6DSL_XL_FS_8G                                ((uint8_t)0x0C) /*!< Full scale: +- 8g */
#define LSM6DSL_XL_FS_16G                               ((uint8_t)0x04) /*!< Full scale: +- 16g */

#define LSM6DSL_XL_FS_MASK                              ((uint8_t)0x0C)

#define LSM6DSL_XL_FS_2G_SENSITIVITY                    ((float)0.061)
#define LSM6DSL_XL_FS_4G_SENSITIVITY                    ((float)0.122)
#define LSM6DSL_XL_FS_8G_SENSITIVITY                    ((float)0.244)
#define LSM6DSL_XL_FS_16G_SENSITIVITY                   ((float)0.488)


/**
 * @}
 */


/** @addtogroup LSM6DSL_XG Accelerometer Anti-aliasing filter bandwidth selection CTRL1_XL
 * @{
 */
#define LSM6DSL_XL_BW_400HZ                             ((uint8_t)0x00) /*!< Anti-aliasing filter bandwidht: 400 Hz */
#define LSM6DSL_XL_BW_200HZ                             ((uint8_t)0x01) /*!< Anti-aliasing filter bandwidht: 200 Hz */
#define LSM6DSL_XL_BW_100HZ                             ((uint8_t)0x02) /*!< Anti-aliasing filter bandwidht: 100 Hz */
#define LSM6DSL_XL_BW_50HZ                              ((uint8_t)0x03) /*!< Anti-aliasing filter bandwidht: 50 Hz */

#define LSM6DSL_XL_BW_MASK                              ((uint8_t)0x03)

/**
 * @}
 */


/** @addtogroup LSM6DSL_XG Accelerometer’s Z-axis output enable selection CTRL9_XL
 * @{
 */
#define LSM6DSL_XL_ZEN_DISABLE                          ((uint8_t)0x00) /*!< Accelerometer’s Z-axis output enable: disable */
#define LSM6DSL_XL_ZEN_ENABLE                           ((uint8_t)0x20) /*!< Accelerometer’s Z-axis output enable: enable */

#define LSM6DSL_XL_ZEN_MASK                             ((uint8_t)0x20)

/**
 * @}
 */


/** @addtogroup LSM6DSL_XG Accelerometer’s Y-axis output enable selection CTRL9_XL
 * @{
 */
#define LSM6DSL_XL_YEN_DISABLE                          ((uint8_t)0x00) /*!< Accelerometer’s Y-axis output enable: disable */
#define LSM6DSL_XL_YEN_ENABLE                           ((uint8_t)0x10) /*!< Accelerometer’s Y-axis output enable: enable */

#define LSM6DSL_XL_YEN_MASK                             ((uint8_t)0x10)

/**
 * @}
 */


/** @addtogroup LSM6DSL_XG Accelerometer’s X-axis output enable selection CTRL9_XL
 * @{
 */
#define LSM6DSL_XL_XEN_DISABLE                          	((uint8_t)0x00) /*!< Accelerometer’s X-axis output enable: disable */
#define LSM6DSL_XL_XEN_ENABLE                           	((uint8_t)0x08) /*!< Accelerometer’s X-axis output enable: enable */

#define LSM6DSL_XL_XEN_MASK                             	((uint8_t)0x08)

//#define LSM6DSL_XG_STATUS_REG                                0x27

/**
 * @}
 */


typedef enum
{
	AXIS_X = 0,
	AXIS_Y ,
	AXIS_Z	
}AXIS_TypeDef;

/* Includes ------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

void appLSM6DSL_SetAccCalData(AXIS_TypeDef axis,int16_t data);
void appLSM6DSL_SetGyroCalData(AXIS_TypeDef axis,int16_t data);

void appLSM6DSL_SetAccData(AXIS_TypeDef axis,int16_t data);
void appLSM6DSL_SetGyroData(AXIS_TypeDef axis,int16_t data);
int16_t appLSM6DSL_GetAccData(AXIS_TypeDef axis);
int16_t appLSM6DSL_GetGyroData(AXIS_TypeDef axis);

void appLSM6DSL_Read(uint8_t DeviceAddr, uint8_t RegisterAddr,
                              uint16_t NumByteToRead,
                              uint8_t* pBuffer);
void appLSM6DSL_Write(uint8_t DeviceAddr, uint8_t RegisterAddr,
                               uint16_t NumByteToWrite,
                               uint8_t* pBuffer);

void appLSM6DSL_Setup(void);
void appLSM6DSL_GetData(void);
void appLSM6DSL_GetWhoAmI(void);


void Accelerator_filter(void);
void Gyroscope_filter(void);

void Angle_Calculate(void);

#ifdef __cplusplus
}
#endif

#endif /* __LSM6DSL_H */

